# a = 1
# b = 10
# print(a,b)
# a, b = b, a # меняем местами значения переменных
# print(a,b)
# #===============================================
#
# l = [1,2,3,4]
# l1 = l # списку l2 присвоена ссылка на l, но НЕ КОПИЯ
# print('l = ', l)
# print('l1 = ', l1)
# l.append(5)
# print('l = ', l)
# print('l1 = ', l1)
# # Создаем копию списка
# l2 = l.copy()
# print('l = ', l)
# print('l2 = ', l2)
# l.append(10)
# print('l = ', l)
# print('l2 = ', l2)
#
# #Уберем повторяющиеся значения из списка (но может нарушиться сортировка)
# l = [1,2,4,4,6,1,4]
# s = set(l)
# l = list(s)
# print(l)
# ===================================

# d = {'a':10, 'b':20, 'c':30, 100:'www'}
# d['y'] = 'qwerty' # добавили еще одну пару ключ-значение
# print(d['y'], d[100]) # доступ к значению по ключу
# asd = d.get('cc', 'нет такого') # ищем ключ, выводим значение либо сообщение
# print(asd)
#
# for k, v in d.items(): # доступ к паре ключ-значение
#     print('key =', k, 'value =', v)
# print('keys',d.keys())
# print('values',d.values())
#=========================================================

greet = {
    'ru':'Привет',
    'en':'hello',
    'de':'guten morgen',
    'default':'unknown language'
}
answer = input('введите язык приветствия: ')
gg = greet.get(answer, greet['default'])
print(gg)
#========================================================